haymanmk/stm32f7xx_grbl/Core/Src/step.c
    // clear DMA interrupt flag
    CLEAR_DMA_IT(X_AXIS_TIM_HANDLE.hdma[X_AXIS_PULSE_TIM_DMA_ID]);
    CLEAR_DMA_IT(Y_AXIS_TIM_HANDLE.hdma[Y_AXIS_PULSE_TIM_DMA_ID]);
    CLEAR_DMA_IT(Z_AXIS_TIM_HANDLE.hdma[Z_AXIS_PULSE_TIM_DMA_ID]);

    // clear timer capture/compare flag
    __HAL_TIM_CLEAR_FLAG(&X_AXIS_TIM_HANDLE, X_AXIS_TIM_FLAG_CCx);
    __HAL_TIM_CLEAR_FLAG(&Y_AXIS_TIM_HANDLE, Y_AXIS_TIM_FLAG_CCx);
    __HAL_TIM_CLEAR_FLAG(&Z_AXIS_TIM_HANDLE, Z_AXIS_TIM_FLAG_CCx);

    // suspend DMA stream
    SUSPEND_DMA_STREAM(X_AXIS_TIM_HANDLE.hdma[X_AXIS_PULSE_TIM_DMA_ID]);
    SUSPEND_DMA_STREAM(Y_AXIS_TIM_HANDLE.hdma[Y_AXIS_PULSE_TIM_DMA_ID]);
    SUSPEND_DMA_STREAM(Z_AXIS_TIM_HANDLE.hdma[Z_AXIS_PULSE_TIM_DMA_ID]);

    // stop DMA OC mode
    HAL_TIM_OC_Stop_DMA(&X_AXIS_TIM_HANDLE, X_AXIS_PULSE_TIM_CHANNEL);
    HAL_TIM_OC_Stop_DMA(&Y_AXIS_TIM_HANDLE, Y_AXIS_PULSE_TIM_CHANNEL);
    HAL_TIM_OC_Stop_DMA(&Z_AXIS_TIM_HANDLE, Z_AXIS_PULSE_TIM_CHANNEL);

    // write the largest value, 0xFFFFFFFF, in capture/compare register
    // to prevent the CCxIF flag from being set when the counter is set to 0.
    __HAL_TIM_SET_COMPARE(&X_AXIS_TIM_HANDLE, X_AXIS_PULSE_TIM_CHANNEL, 0xFFFFFFFF);
    __HAL_TIM_SET_COMPARE(&Y_AXIS_TIM_HANDLE, Y_AXIS_PULSE_TIM_CHANNEL, 0xFFFFFFFF);
    __HAL_TIM_SET_COMPARE(&Z_AXIS_TIM_HANDLE, Z_AXIS_PULSE_TIM_CHANNEL, 0xFFFFFFFF);

    // initialize axis parameters
    INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, X_AXIS);
    INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, Y_AXIS);
    INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, Z_AXIS);

    // initialize ring buffer head and tail
    pulseRingBufferHead = 0;
    pulseRingBufferTail = 0;

    // initialize general notification
    generalNotification |= (GENERAL_NOTIFICATION_GET_NEW_BUFFER | GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES | GENERAL_NOTIFICATION_FIRST_TIME_START);

    // initialize current stepper state
    currentStepperState = 0;

    // initialize DMA transfer completed axes
    DMATransferCompletedAxes = 0;

    // initialize current counter value
    currentCounterValue = MINIMUN_LOW_PULSE_WIDTH_TICKS;

    // initialize pulse block address
    pulseBlockAddress = 0;

    // reset blocked axes
    blockedAxes = 0;

    // reset OC DMA started flag
    OC_DMA_Started = 0;

    // ===> debug message
    // vLoggingPrintf("Step Init\n");

    // check if task is created
    if (xHandleStepTask != NULL)
    {
        // delete the task
        vTaskDelete(xHandleStepTask);

        // set the handle to NULL
        xHandleStepTask = NULL;
    }

    // create tasks
    xTaskCreate(stepTask, "StepTask", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1, &xHandleStepTask);
}

// handler for step task
void stepTask(void *pvParameters)
{
    // set PD3 to high to enable level shifter
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_SET);

    // set general notification to data not available to start the process
    generalNotification |= (GENERAL_NOTIFICATION_GET_NEW_BUFFER | GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES | GENERAL_NOTIFICATION_FIRST_TIME_START);

    // wait notification to calculate pulse data
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

    // Infinite loop
    for (;;)
    {
        // prepare pulse data
        if ((generalNotification & GENERAL_NOTIFICATION_CALCULATE_PULSE))
        {
            // calculate pulse data
            stepper_pulse_generation_isr();
        }
        else
        {
            pulse_block_t *pulseBlock = &(pulseRingBuffer[pulseRingBufferHead]);

            // check if the pulse block is not empty
            // in case appending empty pulse block to DMA
            if (pulseBlock->motion_control_state)
            {
                // increment head
                while (stepRingBufferIncrementHead() == UINT16_MAX)
                {
                    // No more buffer available to store pulse data
                    vTaskDelay(1);
                }
                // ring buffer head has been incremented
                // clear motion control state
                pulseRingBuffer[pulseRingBufferHead].motion_control_state = 0;

                // inform to get new free buffer
                generalNotification |= GENERAL_NOTIFICATION_GET_NEW_BUFFER;
            }
            else
            {
                // wait notification to calculate pulse data
                ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
            }
        }

        // check if there is a notification to resume DMA stream asking from the timer interrupt
        if (!(generalNotification & GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES))
        {
            continue;
        }

        // check if there is any buffer available
        if (stepRingBufferGetTail() == UINT16_MAX)
        {
            continue;
        }

        // check if it is the "First Time" to start the process
        if (generalNotification & GENERAL_NOTIFICATION_FIRST_TIME_START)
        {
            // get available data address
            pulseBlockAddress = stepGetAvailableDataAddress();
            pulse_block_t *pulseBlock = (pulse_block_t *)pulseBlockAddress;

            // set up each axis
            for (int8_t i = NUM_DIMENSIONS - 1; i >= 0; i--)
            {
                // get pulse data
                pulse_t *pulseData = &(pulseBlock->pulse_data[i]);

                // get timer and DMA parameters of this axis
                TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i];

                // reset timer
                __HAL_TIM_SetCounter(timDMAParamsPulse->htim, 0);

                uint8_t dirOutputBit = GET_DIRECTION_BIT_FROM_AXIS(i);
                volatile uint32_t *pDirOutputPort = GET_DIRECTION_PORT_FROM_AXIS(i);

                // set the direction output bit according to the dir_outbit
                *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (pulseBlock->dir_outbits & (1 << dirOutputBit));

                // determine if this axis is active or not by checking motion_control_state coming with the pulse data
                if (pulseBlock->motion_control_state & (1 << i))
                {
                    // set output compare mode
                    SET_OC_OUTPUT_TOGGLE(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL);

