haymanmk/stm32f7xx_grbl/Core/Src/step.c
                    // start timer output mode with DMA stream
                    stepTimeOCStartDMA(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL, (uint32_t *)pulseData, pulseData->length);

                    // generate compare event
                    HAL_TIM_GenerateEvent(timDMAParamsPulse->htim, timDMAParamsPulse->CompareEventID);

                    // set OC DMA started flag
                    OC_DMA_Started |= (1 << i);
                }
                else // this axis is not active
                {
                    // force output pin to low in output compare mode
                    SET_OC_OUTPUT_LOW(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL);
                    // stepSetTimerOC2Mode(timDMAParamsPulse->htim->Instance, TIM_OCMODE_INACTIVE);
                }

                // check if it is the master timer
                if (timDMAParamsPulse->htim != &MASTER_TIM_HANDLE)
                {
                    // enable the timer
                    __HAL_TIM_ENABLE(timDMAParamsPulse->htim);
                }
            }

            // update current motion control state by the motion_control_state coming with the pulse data
            currentStepperState = pulseBlock->motion_control_state;

            // set all DMA updated flag
            generalNotification |= GENERAL_NOTIFICATION_ALL_AXES_DMA_UPDATED;

            // enable the master timer
            __HAL_TIM_ENABLE(&MASTER_TIM_HANDLE);

            // clear the flag
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;
            generalNotification &= ~GENERAL_NOTIFICATION_FIRST_TIME_START;
        }
        // NOT the "First Time" to start the process, but out of data asking from the timer interrupt
        else
        {
            // set PD5 to high ===> signal the start of resuming DMA stream
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_SET);

            // Determine if it should request for new data or not.
            if (currentStepperState == DMATransferCompletedAxes)
            {
                // get available address
                pulseBlockAddress = stepGetAvailableDataAddress();

                if (pulseBlockAddress == 0)
                {
                    // Error_Handler();
                    continue;
                }

                // clear DMA transfer completed axes
                DMATransferCompletedAxes = 0;
            }

            // update DMA buffer
            stepUpdateDMABuffer(pulseBlockAddress);

            // restart counter
            TIM_START_COUNTER(MASTER_TIM_HANDLE);

            // clear the flag
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;

            // set PD5 to low ===> signal the end of resuming DMA stream
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_RESET);
        }
    }
}

HAL_StatusTypeDef stepCalculatePulseData(uint32_t *st_addr)
{
    // set PD4 to high ===> signal the start of pulse calculation
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_SET);

    static uint8_t getNewBuffer = (1 << NUM_DIMENSIONS) - 1; // bit 0: x axis, bit 1: y axis, bit 2: z axis
    static pulse_block_t *pulseBlock = {0};
    static pulse_t *pulse;
    static IO_TYPE dirOutputBits = 0;
    static uint32_t cycles_per_tick = 0;
    // static uint8_t amass_level = 0;

    stepper_t *st = (stepper_t *)st_addr;

    if (st->exec_segment)
    {
        // update variables
        cycles_per_tick = st->exec_segment->cycles_per_tick;
        // amass_level = st->exec_segment->amass_level;
    }

    if (!(st->step_pulse_time) || (st->exec_segment->cycles_per_tick == 0) || (st->exec_segment->cycles_per_tick == 0xffffffff))
    {
        // set PD4 to low ===> signal the end of pulse calculation
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

        return HAL_ERROR;
    }

    // determine if a new buffer is needed
    if (getNewBuffer || (dirOutputBits != st->dir_outbits) || (generalNotification & GENERAL_NOTIFICATION_GET_NEW_BUFFER))
    {
        // check if current buffer is not empty
        pulseBlock = &(pulseRingBuffer[pulseRingBufferHead]);

        if (pulseBlock->motion_control_state)
        {
            // increment head
            if (stepRingBufferIncrementHead() == UINT16_MAX)
            {
                // No more buffer available to store pulse data

                // set PD4 to low ===> signal the end of pulse calculation
                HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

                return HAL_BUSY;
            }
            // ring buffer head has been incremented

            // get the new buffer
            pulseBlock = &(pulseRingBuffer[pulseRingBufferHead]);
        }

        // reset motion control state
        pulseBlock->motion_control_state = 0;

        // set direction state
        pulseBlock->dir_outbits = st->dir_outbits;

        // update direction output bits
        dirOutputBits = st->dir_outbits;

        // loop through all axes
        for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
        {
            // get pulse data
            pulse = &(pulseBlock->pulse_data[i]);

            // clear pulse length
            pulse->length = 0;
        }

        // clear the flag
        generalNotification &= ~GENERAL_NOTIFICATION_GET_NEW_BUFFER;
        getNewBuffer = 0;
    }

    // loop through all axes
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // get timer and DMA parameters of this axis
        TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i];
        uint8_t step_bit = timDMAParamsPulse->Step_Bit;

        // get pulse data
        pulse = &(pulseBlock->pulse_data[i]);

        // determine if a pair of pulse data should be added in this axis or not by Bresenham line algorithm.
        // a pair of pulse data consists of a pulse data for the on state and a pulse data for the off state.
        uint16_t buf_length = pulse->length;

        if (st->step_outbits & (1 << step_bit))
        {
            // set this axis to ACTIVE state
            pulseBlock->motion_control_state |= (1 << i);

            // add pulse data
            // add ON state pulse data
            pulse->data[buf_length++] = currentCounterValue;
            // add OFF state pulse data
            pulse->data[buf_length++] = currentCounterValue + st->step_pulse_time;

            // update the length of available data
            pulse->length = buf_length;

            // check if the buffer is full
            if (buf_length >= DOUBLE_BUFFER_SIZE)
            {
                // set the flag to get new buffer
                getNewBuffer |= (1 << i);
            }
        }
    }

    // update variables
    currentCounterValue += cycles_per_tick; // * (amass_level + 1);

    // check if any buffer is full of data
    if (getNewBuffer)
    {
        // increment head
        while (stepRingBufferIncrementHead() == UINT16_MAX)
        {
            // wait for the buffer to be available
            vTaskDelay(1);
        }

        // clear motion control state
        pulseRingBuffer[pulseRingBufferHead].motion_control_state = 0;
    }

