haymanmk/stm32f7xx_grbl/Core/Src/step.c
    // set PD4 to low ===> signal the end of pulse calculation
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

    return HAL_OK;
}

void stepUpdateDMABuffer(uint32_t address)
{
    // set PD7 to high ===> signal the start of updating DMA buffer
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_SET);

    pulse_block_t *pulseBlock = (pulse_block_t *)address;
    uint8_t upcomingAxesActiveState = pulseBlock->motion_control_state & (~blockedAxes); // get upcoming axes active state
    // check if there is any bit that is set to 0 in currentStepperState
    // and the corresponding bit is set to 1 in upcomingAxesActiveState.
    // make these axes which shall be re-enabled from idle
    uint8_t axisToBeReEnabled = (currentStepperState ^ upcomingAxesActiveState) & upcomingAxesActiveState;

    /**
     * Check if there is any axis that shall be re-enabled from idle, resume DMA stream, or turn into idle state
     */
    // manual update those axes that shall be re-enabled from idle and will stay in idle state in the upcoming cycle
    // to avoid update the same axis twice,
    // loop through all axes
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // pulse data
        pulse_t *pulse = &(pulseBlock->pulse_data[i]);
        uint8_t dirOutputBit = GET_DIRECTION_BIT_FROM_AXIS(i);
        volatile uint32_t *pDirOutputPort = GET_DIRECTION_PORT_FROM_AXIS(i);

        // check if this axis shall be re-enabled from idle
        if ((axisToBeReEnabled & (1 << i)) || ((currentStepperState & upcomingAxesActiveState) & (1 << i)))
        {
            // set the axis to active
            currentStepperState |= (1 << i);

            // set the direction output bit according to the dir_outbit
            *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (pulseBlock->dir_outbits & (1 << dirOutputBit));

            // force output turned into toggle mode
            SET_OC_OUTPUT_TOGGLE(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL);

            // clear the pending DMA request in timer
            CLEAR_PENDING_DMA_REQUEST(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL);

            // resume DMA stream with updated buffer and length

            if (OC_DMA_Started & (1 << i)) // OC DMA might be already started
            {
                RESUME_DMA_STREAM_WITH_TC(axisTimerDMAParams[i].htim->hdma[axisTimerDMAParams[i].TIM_DMA_ID], (uint32_t *)pulse, pulse->length);
            }
            else // OC DMA is not started yet
            {
                stepTimeOCStartDMA(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].TIM_CHANNEL, (uint32_t *)pulse, pulse->length);

                // set OC DMA started flag
                OC_DMA_Started |= (1 << i);
            }
            // generate compare event to trigger the DMA transfer
            GENERATE_TIM_EVENT(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].CompareEventID);
        }
        else // idle mode(present) -> idle mode(upcoming) or active mode(present) -> idle mode(upcoming)
        {
            // turn into idle state

            // set the axis to idle
            currentStepperState &= ~(1 << i);
        }
    }

    /**
     * Update Variables
     */

    // set PD7 to low ===> signal the end of updating DMA buffer
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_RESET);
}

/* =========================================================== */
/*                   DMA Transfer Complete ISR                 */
/* =========================================================== */
/**
 * @brief  TIM DMA Pulse complete callback.
 */
void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim)
{
    // stop counter
    TIM_STOP_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    // set PD6 to high ===> signal the start of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_SET);

    // identify the axis
    axis_t axis = GET_AXIS_FROM_TIM_HANDLE(htim);

    // force output compare mode to inactive
    FORCE_OC_OUTPUT_LOW(htim, axisTimerDMAParams[axis].TIM_CHANNEL);

    // suspend DMA stream
    // ==> to update DMA buffer length and address, DMA stream should be suspended
    SUSPEND_DMA_STREAM(htim->hdma[GET_TIM_DMA_ID_FROM_AXIS(axis)]);

    // avoid doing anything if the step agent has been reset from software.
    if (generalNotification & GENERAL_NOTIFICATION_FIRST_TIME_START)
    {
        // set PD6 to low ===> signal the end of ISR
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);

        return;
    }

    // set the axis that its DMA transfer is completed
    DMATransferCompletedAxes |= (1 << axis);

    /**
     * Start Update DMA buffer
     */
    // determine if it should request for new data or not
    if (currentStepperState == DMATransferCompletedAxes)
    {
        // get the available data address
        pulseBlockAddress = stepGetAvailableDataAddress();

        // check if the address is valid
        if (pulseBlockAddress != 0)
        {
            stepUpdateDMABuffer(pulseBlockAddress);

            // clear DMA transfer completed axes
            DMATransferCompletedAxes = 0;

            // restart counter
            TIM_START_COUNTER(MASTER_TIM_HANDLE);
        }
        else
        {
            // notify main task to update pulse data
            generalNotification |= GET_DATA_NOT_AVAILABLE_BIT(axis);
        }
    }
    else
    {
        // resume counter
        TIM_START_COUNTER(MASTER_TIM_HANDLE); // timer x axis
    }

    // set PD6 to low ===> signal the end of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);
}

/* =========================================================== */
/*       Assistant Functions for Ring buffer management        */
/* =========================================================== */
/**
 * Ring Buffer Manipulation Functions
 */
uint16_t stepRingBufferGetNext()
{
    /**
     * In order to avoid the data updating overwriting the data used by DMA,
     * the head and tail pointers are separated by a gap of N buffers.
     * N is defined by GAP_HEAD_TAIL. Howerver, instead of tracking the gap
     * to determine if there is a next free index, here we simply check if
     * the length of the populated data of ring buffer is less than
     * RING_BUFFER_SIZE - GAP_HEAD_TAIL.
     *
     * i.e.
     * | * | * | * | (Head)>> | 0 | 0 | >>(Tail) | * | * | * |
     * >-------- Body ------->|  GAP  |>------- Body -------->
     */
    uint16_t bodyLength = (pulseRingBufferHead - pulseRingBufferTail + RING_BUFFER_SIZE) % RING_BUFFER_SIZE;

    if (bodyLength < RING_BUFFER_SIZE - GAP_HEAD_TAIL)
    {
        return (pulseRingBufferHead + 1) % RING_BUFFER_SIZE;
    }
    else
        return UINT16_MAX;
}

uint16_t stepRingBufferIncrementHead()
{
    uint16_t nextIndex = stepRingBufferGetNext();

    if (nextIndex != UINT16_MAX)
    {
        pulseRingBufferHead = nextIndex;
    }

    return nextIndex;
}

