haymanmk/stm32f7xx_grbl/Core/Src/step.c
uint16_t stepRingBufferGetTail()
{
    if (pulseRingBufferTail != pulseRingBufferHead)
    {
        return pulseRingBufferTail;
    }
    else
        return UINT16_MAX;
}

void stepRingBufferIncrementTail()
{
    if (pulseRingBufferTail != pulseRingBufferHead)
    {
        pulseRingBufferTail = (pulseRingBufferTail + 1) % (RING_BUFFER_SIZE);
    }
}

/**
 * Get the free data address
 * @param axis Axis to get the free data address
 * @return Free data address; 0 if no data available
 */
uint32_t stepGetFreeDataAddress()
{
    if (stepRingBufferGetNext() == UINT16_MAX)
        return 0;

    return (uint32_t)(&pulseRingBuffer[pulseRingBufferHead]);
}

/**
 * Get the available data address
 * @param axis Axis to get the available data address
 * @return Available data address; 0 if no data available
 */
uint32_t stepGetAvailableDataAddress()
{
    uint16_t tail = stepRingBufferGetTail();

    if (tail == UINT16_MAX)
        return 0;

    stepRingBufferIncrementTail();

    return (uint32_t)(&pulseRingBuffer[tail]);
}

/* ===================================================================== */
/*                      Everything about Stepper                         */
/* ===================================================================== */

void stepWakeUp()
{
    // check if pulse calculation is disabled
    if (generalNotification & GENERAL_NOTIFICATION_FORCE_STOP)
    {
        // clear Force stop flag
        generalNotification &= ~GENERAL_NOTIFICATION_FORCE_STOP;

        // if (!(generalNotification & GENERAL_NOTIFICATION_FIRST_TIME_START))
        // {
        //     // start counter
        //     TIM_START_COUNTER(MASTER_TIM_HANDLE); // timer x axis
        // }
    }

    // start pulse calculation
    // stepEnablePulseCalculate();
}

void stepGoIdle()
{
    // stop counter
    TIM_STOP_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    // set Force stop flag
    generalNotification |= GENERAL_NOTIFICATION_FORCE_STOP;

    // stop pulse calculation
    // stepDisablePulseCalculate();
}

/**
 * @brief  Enable pulse calculation
 */
void stepEnablePulseCalculate()
{
    // clear general notification
    generalNotification |= GENERAL_NOTIFICATION_CALCULATE_PULSE;

    stepNotifyContinuePulseCalculation();
}

/**
 * @brief  Disable pulse calculation
 */
void stepDisablePulseCalculate()
{
    // set general notification to no more segment which is triggered by stepper.c in grbl
    generalNotification &= ~GENERAL_NOTIFICATION_CALCULATE_PULSE;
}

void stepNotifyContinuePulseCalculation()
{
    xTaskNotifyGive(xHandleStepTask);
}

void stepSetTimerOC1Mode(TIM_TypeDef *TIMx, const uint32_t oc_mode)
{
    uint32_t tmpccmrx;
    uint32_t tmpccer;
    // uint32_t tmpcr2;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Disable the Channel 1: Reset the CC1E Bit */
    TIMx->CCER &= ~TIM_CCER_CC1E;

    /* Get the TIMx CCMR1 register value */
    tmpccmrx = TIMx->CCMR1;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= ~TIM_CCMR1_OC1M;
    tmpccmrx &= ~TIM_CCMR1_CC1S;
    /* Select the Output Compare Mode */
    tmpccmrx |= oc_mode;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

void stepSetTimerOC2Mode(TIM_TypeDef *TIMx, const uint32_t oc_mode)
{
    uint32_t tmpccmrx;
    uint32_t tmpccer;
    // uint32_t tmpcr2;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCER &= ~TIM_CCER_CC2E;

    /* Get the TIMx CCMR1 register value */
    tmpccmrx = TIMx->CCMR1;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= ~TIM_CCMR1_OC2M;
    tmpccmrx &= ~TIM_CCMR1_CC2S;
    /* Select the Output Compare Mode */
    tmpccmrx |= (oc_mode << 8U);

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

void stepSetTimerOC3Mode(TIM_TypeDef *TIMx, const uint32_t oc_mode)
{
    uint32_t tmpccmrx;
    uint32_t tmpccer;
    // uint32_t tmpcr2;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Disable the Channel 3: Reset the CC3E Bit */
    TIMx->CCER &= ~TIM_CCER_CC3E;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= ~TIM_CCMR2_OC3M;
    tmpccmrx &= ~TIM_CCMR2_CC3S;
    /* Select the Output Compare Mode */
    tmpccmrx |= oc_mode;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

void stepSetTimerOC4Mode(TIM_TypeDef *TIMx, const uint32_t oc_mode)
{
    uint32_t tmpccmrx;
    uint32_t tmpccer;
    // uint32_t tmpcr2;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIMx->CCER &= ~TIM_CCER_CC4E;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= ~TIM_CCMR2_OC4M;
    tmpccmrx &= ~TIM_CCMR2_CC4S;
    /* Select the Output Compare Mode */
    tmpccmrx |= (oc_mode << 8U);

    /* Write to TIMx CR2 */
    //   TIMx->CR2 = tmpcr2;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

void stepBlockAxis(uint8_t axis)
{
    // get timer and DMA parameters of this axis
    TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[axis];

    // suspend DMA stream
    SUSPEND_DMA_STREAM(timDMAParamsPulse->htim->hdma[timDMAParamsPulse->TIM_DMA_ID]);

    // clear DMA interrupt flag
    CLEAR_DMA_IT(timDMAParamsPulse->htim->hdma[timDMAParamsPulse->TIM_DMA_ID]);

    // force output pin to low in output compare mode
    FORCE_OC_OUTPUT_LOW(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL);

    DMATransferCompletedAxes |= (1 << axis);

    // set the axis to idle
    blockedAxes |= (1 << axis);
}

uint8_t stepIsPulseDataExhausted()
{
    return (generalNotification & GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES);
}

/* ===================================================================== */
/*                      Everything about Timer                           */
/* ===================================================================== */

/**
 * @brief  Starts the TIM Output Compare signal generation in DMA mode.
 * @param  htim TIM Output Compare handle
 * @param  Channel TIM Channel to be enabled
 *          This parameter can be one of the following values:
 *            @arg TIM_CHANNEL_1: TIM Channel 1 selected
 *            @arg TIM_CHANNEL_2: TIM Channel 2 selected
 *            @arg TIM_CHANNEL_3: TIM Channel 3 selected
 *            @arg TIM_CHANNEL_4: TIM Channel 4 selected
 * @param  pData The source Buffer address.
 * @param  Length The length of data to be transferred from memory to TIM peripheral
 * @retval HAL status
 */
HAL_StatusTypeDef stepTimeOCStartDMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData,
                                     uint16_t Length)
{
    HAL_StatusTypeDef status = HAL_OK;
    //   uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, Channel));

    /* Set the TIM channel state */
    if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_BUSY)
    {
        return HAL_BUSY;
    }
    else if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_READY)
    {
        if ((pData == NULL) || (Length == 0U))
        {
            return HAL_ERROR;
        }
        else
        {
            TIM_CHANNEL_STATE_SET(htim, Channel, HAL_TIM_CHANNEL_STATE_BUSY);
        }
    }
    else
    {
        return HAL_ERROR;
    }

    switch (Channel)
    {
    case TIM_CHANNEL_1:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC1]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC1]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC1], (uint32_t)pData, (uint32_t)&htim->Instance->CCR1,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

        /* Enable the TIM Capture/Compare 1 DMA request */
        __HAL_TIM_ENABLE_DMA(htim, TIM_DMA_CC1);
        break;
    }

    case TIM_CHANNEL_2:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC2]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC2]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC2], (uint32_t)pData, (uint32_t)&htim->Instance->CCR2,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

